text = """
Примерно в 2013 году обработка естественного языка и чат-боты начали получать
все большее распространение в нашей жизни. Сначала поиск Google напоминал лишь
работу с предметным указателем — инструментом, для использования которого не
требовалось особых навыков. Но скоро он стал интеллектуальнее и начал понимать
поисковые запросы, все более близкие к естественному языку. Далее еще больше
усложнялась функциональность автодополнения в смартфонах. По центру зачастую
было указано именно интересующее пользователя слово.
В конце 2014 года мы с Сандером Шивайей (Thunder Shiviah) сотрудничали в рамках
одного из проектов Hack Oregon, связанного с интеллектуальным анализом данных о
финансировании избирательной кампании. Мы пытались отыскать связи между источниками
финансирования политиков. Казалось, что политики скрывали своих «инвесторов» за
туманным языком финансовых документов их кампаний. Самое интересное было не то,
что мы смогли раскрыть эти связи с помощью простых методик обработки естественного
языка. Больше всего меня удивляло получение от Сандера лаконичного, но подходящего
ответа через считанные секунды после нажатия мной кнопки Отправить. Оказалось,
что он использовал Smart Reply — утилиту-помощник для Google Inbox, составляющую
ответы быстрее, чем человек может прочитать письмо.
"""